package ru.vsu.cs.mobiledevelopmentproject.data.local

import ru.vsu.cs.mobiledevelopmentproject.domain.model.Lesson
import ru.vsu.cs.mobiledevelopmentproject.domain.model.WeekType

object SampleSchedule {
    val lessons = listOf(
        Lesson("Пн", "13:25–15:00", "Теория информации", "ст.преп. Попова Е.В., ауд. 297", WeekType.NUMERATOR),
        Lesson("Пн", "13:25–15:00", "Электродинамика", "ст.преп. Некипелов Е.А., ауд. 305П", WeekType.DENOMINATOR),
        Lesson("Пн", "15:10–16:45", "Основы разработки Frontend", "асс. Ушаков В.А., ауд. 297", WeekType.NUMERATOR),
        Lesson("Пн", "15:10–16:45", "ТИПиС", "ст.преп. Ермаков М.В., ауд. 387", WeekType.DENOMINATOR),
        Lesson("Пн", "16:55–18:30", "Разработка мобильных приложений", "асс. Ушаков В.А., ауд. 297", WeekType.NUMERATOR),
        Lesson("Пн", "18:40–20:00", "Разработка мобильных приложений", "асс. Ушаков В.А., ауд. 297", WeekType.NUMERATOR),

        Lesson("Вт", "11:30–13:05", "Методы оптимизации", "доц. Дробышев А.А., ауд. 479", WeekType.EVERY),
        Lesson("Вт", "13:25–15:00", "Методы оптимизации", "доц. Михин Е.А., ауд. 305П", WeekType.EVERY),
        Lesson("Вт", "15:10–16:45", "Операционные системы", "доц. Самодуров А.С., ауд. 387", WeekType.NUMERATOR),
        Lesson("Вт", "15:10–16:45", "Физическая культура и спорт", null, WeekType.DENOMINATOR),
        Lesson("Вт", "16:55–18:30", "Физическая культура и спорт", null, WeekType.NUMERATOR),

        Lesson("Ср", "11:30–13:05", "Основы военной подготовки", "Сидоренко Е.В., 10 корпус, ауд. 22", WeekType.NUMERATOR),
        Lesson("Ср", "11:30–13:05", "Основы военной подготовки", "доц. Скоробогатова Л.Г., дистанционно", WeekType.DENOMINATOR),
        Lesson("Ср", "13:25–15:00", "Основы военной подготовки", "Сидоренко Е.В., 10 корпус, ауд. 22", WeekType.NUMERATOR),
        Lesson("Ср", "13:25–15:00", "Основы военной подготовки", "доц. Скоробогатова Л.Г., дистанционно", WeekType.DENOMINATOR),
        Lesson("Ср", "15:10–21:30", "Военная подготовка", null, WeekType.EVERY),

        Lesson("Чт", "13:25–15:00", "Теория информации", "доц. Борисов Д.Н., дистанционно", WeekType.EVERY),
        Lesson("Чт", "15:10–16:45", "Операционные системы", "проф. Савинков А.Ю., дистанционно", WeekType.EVERY),
        Lesson("Чт", "16:55–18:30", "Информационные технологии", "доц. Михайлов Е.М., дистанционно", WeekType.NUMERATOR),

        Lesson("Пт", "11:30–13:05", "Электродинамика", "проф. Запрягаев С.А., дистанционно", WeekType.EVERY),
        Lesson("Пт", "13:25–15:00", "Теория информационных процессов и систем", "проф. Десятирикова Е.Н., дистанционно", WeekType.EVERY),
        Lesson("Пт", "15:10–16:45", "Методы и средства проектирования ИС", "ст.преп. Малыхин А.Ю., дистанционно", WeekType.EVERY),
        Lesson("Пт", "16:55–18:30", "Основы разработки Frontend", "ст.преп. Чекмарев А.И., дистанционно", WeekType.NUMERATOR),

        Lesson("Сб", "9:45–11:20", "Физическая культура и спорт", null, WeekType.DENOMINATOR),
        Lesson("Сб", "11:30–13:05", "Физическая культура и спорт", null, WeekType.NUMERATOR),
        Lesson("Сб", "11:30–13:05", "Теория информации", "ст.преп. Попова Е.В., ауд. 385", WeekType.DENOMINATOR),
        Lesson("Сб", "13:25–15:00", "Информационные технологии", "асс. Рыжков В.А., ауд. 314П", WeekType.DENOMINATOR),
        Lesson("Сб", "15:10–16:45", "МиСПИС", "асс. Соколов В.А., ауд. 290", WeekType.DENOMINATOR),
    )
}